soap-adapters/src/test/resources/costume/getAll.xml

<?xml version="1.0" encoding="UTF-8"?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <S:Body xmlns:ns2="http://services.soapadapters.appports.tks.ias.org/">
        <ns2:getAll/>
    </S:Body>
</S:Envelope>